hathach/tinyusb/hw/bsp/at32f435_437/boards/AT_START_F435_437/AT32F437xx_v2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>EDMA</name>
      <description>EDMA controller</description>
      <groupName>EDMA</groupName>
      <baseAddress>0x40026000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>EDMA_Stream1</name>
        <description>EDMA Stream1 global interrupt</description>
        <value>11</value>
      </interrupt>
      <interrupt>
        <name>EDMA_Stream2</name>
        <description>EDMA Stream2 global interrupt</description>
        <value>12</value>
      </interrupt>
      <interrupt>
        <name>EDMA_Stream3</name>
        <description>EDMA Stream3 global interrupt</description>
        <value>13</value>
      </interrupt>
      <interrupt>
        <name>EDMA_Stream4</name>
        <description>EDMA Stream4 global interrupt</description>
        <value>14</value>
      </interrupt>
      <interrupt>
        <name>EDMA_Stream5</name>
        <description>EDMA Stream5 global interrupt</description>
        <value>15</value>
      </interrupt>
      <interrupt>
        <name>EDMA_Stream6</name>
        <description>EDMA Stream6 global interrupt</description>
        <value>16</value>
      </interrupt>
      <interrupt>
        <name>EDMA_Stream7</name>
        <description>EDMA Stream7 global interrupt</description>
        <value>17</value>
      </interrupt>
      <interrupt>
        <name>EDMA_Stream8</name>
        <description>EDMA Stream8 global interrupt</description>
        <value>47</value>
      </interrupt>
      <registers>
        <register>
          <name>STS1</name>
          <displayName>STS1</displayName>
          <description>Interrupt status register1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDTF4</name>
              <description>Stream 4 Full data transfer interrupt flag
        </description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDTF4</name>
              <description>Stream 4 half data transfer interrupt flag
              </description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTERRF4</name>
              <description>Stream 4 transfer error interrupt flag
              </description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMERRF4</name>
              <description>Stream 4 direct mode error interrupt flag
        </description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FERRF4</name>
              <description>Stream 4 FIFO error interrupt flag
              </description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FDTF3</name>
              <description>Stream 3 Full data transfer interrupt flag
        </description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDTF3</name>
              <description>Stream 3 half data transfer interrupt flag
              </description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTERRF3</name>
              <description>Stream 3 transfer error interrupt flag
              </description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMERRF3</name>
              <description>Stream 3 direct mode error interrupt flag
        </description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FERRF3</name>
              <description>Stream 3 FIFO error interrupt flag
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FDTF2</name>
              <description>Stream 2 Full data transfer interrupt flag
        </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDTF2</name>
              <description>Stream 2 half data transfer interrupt flag
              </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTERRF2</name>
              <description>Stream 2 transfer error interrupt flag
              </description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMERRF2</name>
              <description>Stream 2 direct mode error interrupt flag
        </description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FERRF2</name>
              <description>Stream 2 FIFO error interrupt flag
              </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FDTF1</name>
              <description>Stream 1 Full data transfer interrupt flag
        </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDTF1</name>
              <description>Stream 1 half data transfer interrupt flag
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTERRF1</name>
              <description>Stream 1 transfer error interrupt flag
              </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMERRF1</name>
              <description>Stream 1 direct mode error interrupt flag
        </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FERRF1</name>
              <description>Stream 1 FIFO error interrupt flag
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>STS2</name>
          <displayName>STS2</displayName>
          <description>Interrupt status register2</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDTF8</name>
              <description>Stream 8 full data transfer interrupt flag
        </description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDTF8</name>
              <description>Stream 8 half data transfer interrupt flag
              </description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTERRF8</name>
              <description>Stream 8 transfer error interrupt flag
              </description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMERRF8</name>
              <description>Stream 8 direct mode error interrupt flag
        </description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FERRF8</name>
              <description>Stream 8 FIFO error interrupt flag
              </description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FDTF7</name>
              <description>Stream 7 full data transfer interrupt flag
        </description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDTF7</name>
              <description>Stream 7 half data transfer interrupt flag
              </description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTERRF7</name>
              <description>Stream 7 transfer error interrupt flag
              </description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMERRF7</name>
              <description>Stream 7 direct mode error interrupt flag
        </description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FERRF7</name>
              <description>Stream 7 FIFO error interrupt flag
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FDTF6</name>
              <description>Stream 6 full data transfer interrupt flag
        </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDTF6</name>
              <description>Stream 6 half data transfer interrupt flag
              </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTERRF6</name>
              <description>Stream 6 transfer error interrupt flag
              </description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMERRF6</name>
              <description>Stream 6 direct mode error interrupt flag
        </description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FERRF6</name>
              <description>Stream 6 FIFO error interrupt flag
              </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FDTF5</name>
              <description>Stream 5 full data transfer interrupt flag
        </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDTF5</name>
              <description>Stream 5 half data transfer interrupt flag
              </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTERRF5</name>
              <description>Stream 5 transfer error interrupt flag
              </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMERRF5</name>
              <description>Stream 5 direct mode error interrupt flag
        </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FERRF5</name>
              <description>Stream 5 FIFO error interrupt flag
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR1</name>
          <displayName>CLR1</displayName>
          <description>Interrupt flag clear register1
      </description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDTFC4</name>
              <description>Stream 4 clear full data transfer complete interrupt flag
        </description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDTFC4</name>
              <description>Stream 4 clear half data transfer interrupt flag
        </description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTERRFC4</name>
              <description>Stream 4 clear transfer error interrupt flag
        </description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMERRFC4</name>
              <description>Stream 4 clear direct mode error interrupt flag
        </description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FERRFC4</name>
              <description>Stream 4 clear FIFO error interrupt flag
              </description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FDTFC3</name>
              <description>Stream 3 clear full data transfer complete interrupt flag
        </description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDTFC3</name>
              <description>Stream 3 clear half data transfer interrupt flag
        </description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTERRFC3</name>
              <description>Stream 3 clear transfer error interrupt flag
        </description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMERRFC3</name>
              <description>Stream 3 clear direct mode error interrupt flag
        </description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FERRFC3</name>
              <description>Stream 3 clear FIFO error interrupt flag
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FDTFC2</name>
              <description>Stream 2 clear full data transfer complete interrupt flag
        </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDTFC2</name>
              <description>Stream 2 clear half data transfer interrupt flag
        </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTERRFC2</name>
              <description>Stream 2 clear transfer error interrupt flag
        </description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMERRFC2</name>
              <description>Stream 2 clear direct mode error interrupt flag
        </description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FERRFC2</name>
              <description>Stream 2 clear FIFO error interrupt flag
              </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FDTFC1</name>
              <description>Stream 1 clear full data transfer complete interrupt flag
        </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDTFC1</name>
              <description>Stream 1 clear half data transfer interrupt flag
        </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTERRFC1</name>
              <description>Stream 1 clear transfer error interrupt flag
        </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMERRFC1</name>
              <description>Stream 1 clear direct mode error interrupt flag
        </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FERRFC1</name>
              <description>Stream 1 clear FIFO error interrupt flag
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CLR2</name>
          <displayName>CLR2</displayName>
          <description>Interrupt flag clear register2
      </description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>FDTFC8</name>
              <description>Stream 8 clear full data transfer complete interrupt flag
        </description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDTFC8</name>
              <description>Stream 8 clear half data transfer interrupt flag
        </description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTERRFC8</name>
              <description>Stream 8 clear transfer error interrupt flag
        </description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMERRFC8</name>
              <description>Stream 8 clear direct mode error interrupt flag
        </description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FERRFC8</name>
              <description>Stream 8 clear FIFO error interrupt flag
              </description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FDTFC7</name>
              <description>Stream 7 clear full data transfer complete interrupt flag
        </description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDTFC7</name>
              <description>Stream 7 clear half data transfer interrupt flag
        </description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTERRFC7</name>
              <description>Stream 7 clear transfer error interrupt flag
        </description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMERRFC7</name>
              <description>Stream 7 clear direct mode error interrupt flag
        </description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FERRFC7</name>
              <description>Stream 7 clear FIFO error interrupt flag
              </description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FDTFC6</name>
              <description>Stream 6 clear full data transfer complete interrupt flag
        </description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDTFC6</name>
              <description>Stream 6 clear half data transfer interrupt flag
        </description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTERRFC6</name>
              <description>Stream 6 clear transfer error interrupt flag
        </description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMERRFC6</name>
              <description>Stream 6 clear direct mode error interrupt flag
        </description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FERRFC6</name>
              <description>Stream 6 clear FIFO error interrupt flag
              </description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FDTFC5</name>
              <description>Stream 5 clear full data transfer complete interrupt flag
        </description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>HDTFC5</name>
              <description>Stream 5 clear half data transfer interrupt flag
        </description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DTERRFC5</name>
              <description>Stream 5 clear transfer error interrupt flag
        </description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DMERRFC5</name>
              <description>Stream 5 clear direct mode error interrupt flag
        </description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FERRFC5</name>
              <description>Stream 5 clear FIFO error interrupt flag
              </description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
