hathach/tinyusb/hw/bsp/at32f435_437/boards/AT_START_F435_437/AT32F437xx_v2.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>DEBUG</name>
      <description>Debug support</description>
      <groupName>DEBUG</groupName>
      <baseAddress>0xE0042000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>IDCODE</name>
          <displayName>IDCODE</displayName>
          <description>DEBUG IDCODE</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>PID</name>
              <description>Product ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRL</name>
          <displayName>CTRL</displayName>
          <description>DEBUG CTRL</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>SLEEP_DEBUG</name>
              <description>SLEEP_DEBUG</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DEEPSLEEP_DEBUG</name>
              <description>DEEPSLEEP_DEBUG</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STANDBY_DEBUG</name>
              <description>STANDBY_DEBUG</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB1_PAUSE</name>
          <displayName>APB1_PAUSE</displayName>
          <description>DEBUG APB1 PAUSE</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>TMR2_PAUSE</name>
              <description>TMR2_PAUSE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR3_PAUSE</name>
              <description>TMR3_PAUSE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR4_PAUSE</name>
              <description>TMR4_PAUSE</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR5_PAUSE</name>
              <description>TMR5_PAUSE</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR6_PAUSE</name>
              <description>TMR6_PAUSE</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR7_PAUSE</name>
              <description>TMR7_PAUSE</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR12_PAUSE</name>
              <description>TMR12_PAUSE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR13_PAUSE</name>
              <description>TMR13_PAUSE</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR14_PAUSE</name>
              <description>TMR14_PAUSE</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERTC_PAUSE</name>
              <description>ERTC_PAUSE</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WWDT_PAUSE</name>
              <description>WWDT_PAUSE</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WDT_PAUSE</name>
              <description>WDT_PAUSE</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ERTC512_PAUSE</name>
              <description>ERTC512_PAUSE</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C1_SMBUS_TIMEOUT</name>
              <description>I2C1_SMBUS_TIMEOUT</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAN1_PAUSE</name>
              <description>CAN1_PAUSE</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>CAN2_PAUSE</name>
              <description>CAN2_PAUSE</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C2_SMBUS_TIMEOUT</name>
              <description>I2C2_SMBUS_TIMEOUT</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>I2C3_SMBUS_TIMEOUT</name>
              <description>I2C3_SMBUS_TIMEOUT</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>APB2_PAUSE</name>
          <displayName>APB2_PAUSE</displayName>
          <description>DEBUG APB2 PAUSE</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>TMR1_PAUSE</name>
              <description>TMR1_PAUSE</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR8_PAUSE</name>
              <description>TMR8_PAUSE</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR20_PAUSE</name>
              <description>TIM20_PAUSE</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR9_PAUSE</name>
              <description>TMR9_PAUSE</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR10_PAUSE</name>
              <description>TMR10_PAUSE</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TMR11_PAUSE</name>
              <description>TMR11_PAUSE</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>SER_ID</name>
          <displayName>SER_ID</displayName>
          <description>SERIES ID</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-only</access>
          <resetValue>0x0</resetValue>
          <fields>
            <field>
              <name>REV_ID</name>
              <description>version ID</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>SER_ID</name>
              <description>series ID</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
